
# Задание до обновления платформы

# num1 = 5
# num2 = 3
# sum = (num1+num2)
# print(sum)
# result = (sum+num1*num2)
# print(result)

# Практическое задание по уроку "Строки и индексация строк"
# Выполните следующие действия в PyCharm:
# В переменную example запишите любую строку.
# Выведите на экран(в консоль) первый символ этой строки.
# Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
# Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
# Выведите на экран(в консоль) это слово наоборот.
# Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')

example = 'Топинамбур'
print(example[0])
print(example[-1])
# a = len(example) / 2
# print(a)
print(example[5:])
print(example[::-1])
print(example[1::2])

